app/Models/Public/ClientModel.php

SELECT `pg`.`id`, `pg`.`ids`, `pg`.`page_type`, `pg`.`name`, `pl`.`page_seo`, `pl`.`sections_layout`, `pl`.`options`
FROM `pages` `pg`
JOIN `pages_lang` `pl` ON `pl`.`page_id` = `pg`.`id`
WHERE `pg`.`page_type` = 'home_page'
AND `pl`.`lang_code` = 'en'
AND `pg`.`status` = 1
---
    public function get_item_home_page($params = [], $options = []) {
        $builder = $this->db->table($this->tb_pages . ' pg')
                    ->select('pg.id, pg.ids, pg.page_type, pg.name')
                    ->select('pl.page_seo, pl.sections_layout, pl.options')
                    ->join($this->tb_pages_lang . ' pl', 'pl.page_id = pg.id');
        // Where
        $builder->where('pg.page_type', 'home_page');
        $builder->where('pl.lang_code', $params['language_info']['current_language']);
        $builder->where('pg.status', 1);
        $result = $builder->get()->getRowArray();

SELECT `pg`.`id`, `pg`.`ids`, `pg`.`page_type`, `pg`.`name`, `pl`.`page_seo`, `pl`.`sections_layout`, `pl`.`options`
FROM `pages` `pg`
JOIN `pages_lang` `pl` ON `pl`.`page_id` = `pg`.`id`
WHERE `pl`.`url_slug` = 'buy-instagram-likes'
AND `pl`.`lang_code` = 'en'
AND `pg`.`status` = 1
---
    public function get_item_basic_page($params = [], $options = []) {
        $language_info = $params['language_info'];
        if ($language_info['previous_language'] != $language_info['current_language']) {
            $item_lang_old = db_get('page_id, url_slug', $this->tb_pages_lang, ['url_slug' => $params['url_slug'], 'lang_code' => $language_info['previous_language']]);
            if ($item_lang_old) {
                $item_lang_new = db_get('page_id, lang_code, url_slug', $this->tb_pages_lang, ['page_id' => $item_lang_old['page_id'], 'lang_code' => $language_info['current_language']]);
                if (!empty($item_lang_new)) {
                    $slug = $language_info['current_language'] . '/' . $item_lang_new['url_slug'];
                    return [
                        'redirect'      => true,
                        'redirect_url'  => client_url($slug),
                    ];
                } else {
                    $slug = $language_info['current_language'] . '/' . $item_lang_old['url_slug'];
                    return [
                        'redirect'      => true,
                        'redirect_url'  => client_url($slug),
                    ];
                }
            }
            return null;
        } else {
            $builder = $this->db->table($this->tb_pages . ' pg')
                        ->select('pg.id, pg.ids, pg.page_type, pg.name')
                        ->select('pl.page_seo, pl.sections_layout, pl.options')
                        ->join($this->tb_pages_lang . ' pl', 'pl.page_id = pg.id');
            // Where
            $builder->where('pl.url_slug', $params['url_slug']);
            $builder->where('pl.lang_code', $language_info['current_language']);
            $builder->where('pg.status', 1);
            $result = $builder->get()->getRowArray();

SELECT `cg`.`id`, `cg`.`ids`, `cg`.`name`, `cg`.`icon_class`, `cl`.`page_seo`, `cl`.`unit_name`, `cl`.`sections_layout`, `cl`.`options`
FROM `categories` `cg`
JOIN `categories_lang` `cl` ON `cl`.`cate_id` = `cg`.`id`
WHERE `cl`.`url_slug` = 'buy-instagram-likes'
AND `cg`.`status` = 1
AND `cl`.`lang_code` = 'en'
---
    public function get_item_category_page($params = [], $options = []) {
        $language_info = $params['language_info'];
        if ($language_info['previous_language'] != $language_info['current_language']) {
            $item_lang_old = db_get('cate_id, url_slug', $this->tb_categories_lang, ['url_slug' => $params['url_slug'], 'lang_code' => $language_info['previous_language']]);
            if ($item_lang_old) {
                $item_lang_new = db_get('cate_id, lang_code, url_slug', $this->tb_categories_lang, ['cate_id' => $item_lang_old['cate_id'], 'lang_code' => $language_info['current_language']]);
                if (!empty($item_lang_new)) {
                    $slug = $language_info['current_language'] . '/' . $item_lang_new['url_slug'];
                    return [
                        'redirect'      => true,
                        'redirect_url'  => client_url($slug),
                    ];
                } else {
                    $slug = $language_info['current_language'] . '/' . $item_lang_old['url_slug'];
                    return [
                        'redirect'      => true,
                        'redirect_url'  => client_url($slug),
                    ];
                }
            }
            return null;
        } else {
            $builder = $this->db->table($this->tb_categories . ' cg')
                        ->select('cg.id, cg.ids, cg.name, cg.icon_class')
                        ->select('cl.page_seo, cl.unit_name, cl.sections_layout, cl.options')
                        ->join($this->tb_categories_lang . ' cl', 'cl.cate_id = cg.id');
            // Where
            $builder->where('cl.url_slug', $params['url_slug']);
            $builder->where('cg.status', 1);
            $builder->where('cl.lang_code', $language_info['current_language']);
            $result = $builder->get()->getRowArray();

SELECT `rating`, COUNT(*) as total_reviews
FROM `reviews`
WHERE `status` = 1
GROUP BY `rating`
ORDER BY `rating` ASC
---
    public function get_total_reviews_count_by_rating() {
        $builder = $this->db->table($this->tb_reviews);
        $results = $builder->select('rating, COUNT(*) as total_reviews')
                           ->where('status', 1)
                           ->groupBy('rating')
                           ->orderBy('rating', 'ASC')
                           ->get()
                           ->getResultArray();